Repository: anmt2805/NEWSCrawling
Catalog: app/lib/l10n/app_*.arb
Languages: ar, es, fr, ja, ko, ru

# tokensLabel
source: Tokens : {count}
ar: الرموز : {count}
fr: Jetons : {count}
ja: トークン : {count}
ko: 토큰 : {count}
ru: Токены : {count}

# breakingTab
source: Breaking news
ar: عاجل
es: Últimas
fr: À la une
ja: 速報
ko: 속보
ru: Срочно

# breakingTabShort
source: Breaking
ar: عاجل
es: Últimas
fr: À la une
ja: 速報
ko: 속보
ru: Срочно

# topBreakingHeadlines
source: Top breaking headlines · {region}
ar: أهم الأخبار العاجلة · {region}
es: Últimas noticias · {region}
fr: Dernières infos · {region}
ja: 速報トップ · {region}
ko: 주요 속보 · {region}
ru: Главные новости · {region}

source: Tap title to edit keyword
ar: اضغط على العنوان لتعديل الكلمة المفتاحية
es: Toca el título para editar la palabra clave
fr: Touchez le titre pour modifier le mot-clé
ja: タイトルをタップしてキーワードを編集
ko: 제목을 눌러 키워드 수정
ru: Нажмите заголовок, чтобы изменить ключевое слово

# noKeywordSet
source: No keyword set for this tab.
ar: لا توجد كلمة مفتاحية لهذه التبويب.
es: No hay palabra clave en esta pestaña.
fr: Aucun mot-clé défini pour cet onglet.
ja: このタブにキーワードが設定されていません。
ko: 이 탭에 키워드가 없습니다.
ru: Для этой вкладки не задано ключевое слово.

source: Set keyword
ar: تعيين كلمة مفتاحية
es: Configurar palabra clave
fr: Définir un mot-clé
ja: キーワードを設定
ko: 키워드 설정
ru: Задать ключевое слово

source: Set keyword for {tab}
ar: تعيين كلمة مفتاحية لـ {tab}
es: Configurar palabra clave para {tab}
fr: Définir un mot-clé pour {tab}
ja: {tab} のキーワードを設定
ko: {tab} 키워드 설정
ru: Задать ключевое слово для {tab}

# keywordHint
source: e.g. AI, climate, bitcoin
ar: مثال: AI، المناخ، بيتكوين
es: ej.: IA, clima, bitcoin
fr: ex. IA, climat, bitcoin
ja: 例: AI、気候、ビットコイン
ko: 예: AI, 기후, 비트코인
ru: например: AI, климат, биткоин

source: Cancel
ar: إلغاء
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
ru: Отмена

source: Save
ar: حفظ
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
ru: Сохранить

# breakingNewsFixed
source: Breaking news is fixed.
ar: Breaking news ثابت.
es: Breaking news es fijo.
fr: Breaking news est fixé.
ja: Breaking news は固定です。
ko: 브레이킹 뉴스는 고정입니다.
ru: Breaking news фиксирован.

source: Fixed: {label}
ar: ثابت: {label}
es: Fijo: {label}
fr: Fixé : {label}
ja: 固定: {label}
ko: 고정: {label}
ru: Фиксировано: {label}

source: No keyword
ar: بدون كلمة مفتاحية
es: Sin palabra clave
fr: Aucun mot-clé
ja: キーワードなし
ko: 키워드 없음
ru: Нет ключевого слова

source: Region filter
ar: تصفية المنطقة
es: Filtro de región
fr: Filtre de région
ja: 地域フィルター
ko: 지역 필터
ru: Фильтр региона

source: Refresh
ar: تحديث
es: Actualizar
fr: Actualiser
ja: 更新
ko: 새로고침
ru: Обновить

source: Toggle theme
ar: تبديل المظهر
es: Cambiar tema
fr: Changer le thème
ja: テーマ切替
ko: 테마 전환
ru: Переключить тему

# regionSettingsTitle
source: Article region
ar: منطقة المقال
es: Región del artículo
fr: Région de l'article
ja: 記事の地域
ko: 기사 작성 국가
ru: Регион статьи

# languageSettingsTitle
source: App language
ar: لغة التطبيق
es: Idioma de la app
fr: Langue de l'application
ja: アプリ言語
ko: 앱 언어
ru: Язык приложения

# languageEnglish
source: English
ar: الإنجليزية
es: Inglés
fr: Anglais
ja: 英語
ko: 영어
ru: Английский

# languageEnglishUk
source: English (UK)
ar: الإنجليزية (المملكة المتحدة)
es: Inglés (UK)
fr: Anglais (R.-U.)
ja: 英語(英国)
ko: 영어(영국)
ru: Английский (Великобритания)

# languageKorean
source: Korean
ar: الكورية
es: Coreano
fr: Coréen
ja: 韓国語
ko: 한국어
ru: Корейский

# languageJapanese
source: Japanese
ar: اليابانية
es: Japonés
fr: Japonais
ja: 日本語
ko: 일본어
ru: Японский

# languageFrench
source: French
ar: الفرنسية
es: Francés
fr: Français
ja: フランス語
ko: 프랑스어
ru: Французский

# languageSpanish
source: Spanish
ar: الإسبانية
es: Español
fr: Espagnol
ja: スペイン語
ko: 스페인어
ru: Испанский

# languageRussian
source: Russian
ar: الروسية
es: Ruso
fr: Russe
ja: ロシア語
ko: 러시아어
ru: Русский

# languageArabic
source: Arabic
ar: العربية
es: Árabe
fr: Arabe
ja: アラビア語
ko: 아랍어
ru: Арабский

# notificationSettingsTitle
source: Push notification settings
ar: إعدادات الإشعارات
es: Ajustes de notificaciones
fr: Paramètres des notifications
ja: プッシュ通知設定
ko: 푸시 알림 설정
ru: Настройки уведомлений

# notificationsTitle
source: Notifications
ar: الإشعارات
es: Notificaciones
ja: 通知
ko: 알림
ru: Уведомления

# notificationsClear
source: Clear
ar: مسح الكل
es: Borrar todo
fr: Tout effacer
ja: すべてクリア
ko: 모두 지우기
ru: Очистить все

# notificationsEmpty
source: No notifications yet.
ar: لا توجد إشعارات.
es: No hay notificaciones.
fr: Aucune notification.
ja: 通知はありません。
ko: 알림이 없습니다.
ru: Уведомлений нет.

# notificationsSeverity
source: Severity
ar: مستوى الخطورة
es: Gravedad
fr: Gravité
ja: 重大度
ko: 심각도
ru: Серьёзность

# regionUnitedStates
source: United States
ar: الولايات المتحدة
es: Estados Unidos
fr: États-Unis
ja: アメリカ
ko: 미국
ru: США

# regionUnitedKingdom
source: United Kingdom
ar: المملكة المتحدة
es: Reino Unido
fr: Royaume-Uni
ja: イギリス
ko: 영국
ru: Великобритания

# regionKorea
source: South Korea
ar: كوريا الجنوبية
es: Corea del Sur
fr: Corée du Sud
ja: 韓国
ko: 대한민국
ru: Южная Корея

# regionJapan
source: Japan
ar: اليابان
es: Japón
fr: Japon
ja: 日本
ko: 일본
ru: Япония

# regionFrance
source: France
ar: فرنسا
es: Francia
ja: フランス
ko: 프랑스
ru: Франция

# regionSpain
source: Spain
ar: إسبانيا
es: España
fr: Espagne
ja: スペイン
ko: 스페인
ru: Испания

# regionRussia
source: Russia
ar: روسيا
es: Rusia
fr: Russie
ja: ロシア
ko: 러시아
ru: Россия

# regionUnitedArabEmirates
source: United Arab Emirates
ar: الإمارات
es: Emiratos Árabes Unidos
fr: Émirats arabes unis
ja: アラブ首長国連邦
ko: 아랍에미리트
ru: ОАЭ

# regionAllCountries
source: All countries
ar: كل الدول
es: Todos los países
fr: Tous les pays
ja: すべての国
ko: 모든 국가
ru: Все страны

# syncChoiceTitle
source: Choose data to use
ar: اختيار البيانات
es: Elegir datos
fr: Choisir les données
ja: データの選択
ko: 데이터 선택
ru: Выбор данных

# syncChoiceBody
source: We found data saved on your account. Which data should we keep?
ar: يوجد بيانات محفوظة في الحساب. أي بيانات تريد استخدامها؟
es: Hay datos guardados en tu cuenta. ¿Qué datos quieres usar?
fr: Des données sont déjà enregistrées sur votre compte. Lesquelles utiliser ?
ja: アカウントに保存されたデータが見つかりました。どちらを使いますか？
ko: 계정에 저장된 데이터가 있습니다. 어떤 데이터를 사용할까요?
ru: В аккаунте есть сохраненные данные. Какие использовать?

# syncChoiceUseCloud
source: Use account data
ar: استخدام بيانات الحساب
es: Usar datos de la cuenta
fr: Utiliser les données du compte
ja: アカウントのデータを使用
ko: 계정 데이터 불러오기
ru: Использовать данные аккаунта

# syncChoiceKeepLocal
source: Keep this device
ar: الاحتفاظ بهذا الجهاز
es: Mantener este dispositivo
fr: Garder cet appareil
ja: この端末のデータを使用
ko: 현재 기기 유지
ru: Оставить на устройстве

# notificationBreakingTitle
source: Breaking alerts
ar: تنبيهات عاجلة
es: Alertas urgentes
fr: Alertes flash
ja: 速報アラート
ko: 속보 알림
ru: Срочные оповещения

# notificationBreakingSubtitle
source: Critical alerts only
ar: حرج (المستوى 5) فقط
es: Solo crítico (nivel 5)
fr: Critique (niveau 5) uniquement
ja: 重大(5段階)のみ
ko: 긴급(5단계)만 수신
ru: Только критические (уровень 5)

# notificationKeywordTitle
source: Keyword alerts
ar: تنبيهات الكلمات المفتاحية
es: Alertas por palabra clave
fr: Alertes par mot-clé
ja: キーワード通知
ko: 키워드 알림
ru: Уведомления по ключевым словам

# notificationSeverity4
source: Severity 4
ar: المستوى 4
es: Nivel 4
fr: Niveau 4
ja: レベル4
ko: 4단계
ru: Уровень 4

# notificationSeverity5
source: Severity 5
ar: المستوى 5
es: Nivel 5
fr: Niveau 5
ja: レベル5
ko: 5단계
ru: Уровень 5

# notificationSeverity4Label
source: High
ar: خطير
es: Grave
fr: Important
ja: 深刻
ko: 심각
ru: Высокая

# notificationSeverity5Label
source: Critical
ar: خطير جدًا
es: Muy grave
fr: Critique
ja: 極めて深刻
ko: 매우 심각
ru: Критическая

# exitConfirmTitle
source: Exit app?
ar: إغلاق التطبيق؟
es: ¿Salir de la app?
fr: Quitter l'application ?
ja: アプリを終了しますか？
ko: 앱을 종료하시겠습니까?
ru: Выйти из приложения?

# exitConfirmBody
source: Do you want to close the app?
ar: هل تريد إغلاق التطبيق؟
es: ¿Quieres cerrar la app?
fr: Voulez-vous fermer l'application ?
ja: アプリを終了しますか？
ko: 앱을 종료할까요?
ru: Закрыть приложение?

# exitConfirmNo
source: No
ar: لا
fr: Non
ja: いいえ
ko: 아니요
ru: Нет

# exitConfirmYes
source: Yes
ar: نعم
es: Sí
fr: Oui
ja: はい
ko: 예
ru: Да

# loginRequiredTitle
source: Sign-in required
ar: يلزم تسجيل الدخول
es: Se requiere iniciar sesión
fr: Connexion requise
ja: ログインが必要です
ko: 로그인이 필요합니다
ru: Требуется вход

# loginRequiredBody
source: Sign in to purchase tabs or tokens.
ar: سجّل الدخول لشراء التبويبات أو الرموز.
es: Inicia sesión para comprar pestañas o tokens.
fr: Connectez-vous pour acheter des onglets ou des jetons.
ja: タブ購入とトークン充電のためログインしてください。
ko: 탭 구매와 토큰 충전을 위해 로그인해주세요.
ru: Войдите, чтобы покупать вкладки или токены.

# loginFailedTitle
source: Sign-in failed
ar: فشل تسجيل الدخول
es: Error de inicio de sesión
fr: Échec de la connexion
ja: ログインに失敗しました
ko: 로그인 실패
ru: Не удалось войти

# loginFailedBody
source: Google sign-in failed. Please try again.
ar: فشل تسجيل الدخول عبر Google. حاول مرة أخرى.
es: Falló el inicio de sesión con Google. Inténtalo de nuevo.
fr: La connexion Google a échoué. Veuillez réessayer.
ja: Googleログインに失敗しました。もう一度お試しください。
ko: Google 로그인에 실패했습니다. 다시 시도해주세요.
ru: Не удалось войти через Google. Попробуйте ещё раз.

# purchaseLockedTitle
source: Unlock in order
ar: افتح بالترتيب
es: Desbloqueo en orden
fr: Déverrouillage séquentiel
ja: 順番に開放してください
ko: 순서대로 해제하세요
ru: Открывайте по порядку

# purchaseLockedBody
source: Please unlock the previous tab first.
ar: يرجى فتح التبويب السابق أولًا.
es: Primero desbloquea la pestaña anterior.
fr: Déverrouillez d'abord l'onglet précédent.
ja: 前のタブを先に購入してください。
ko: 이전 탭을 먼저 구매해야 합니다.
ru: Сначала купите предыдущую вкладку.

# insufficientTokensTitle
source: Not enough tokens
ar: الرموز غير كافية
es: Tokens insuficientes
fr: Jetons insuffisants
ja: トークン不足
ko: 토큰이 부족합니다
ru: Недостаточно токенов

# insufficientTokensBody
source: You need more tokens to purchase this tab.
ar: تحتاج إلى رموز إضافية لشراء هذا التبويب.
es: Necesitas más tokens para comprar esta pestaña.
fr: Rechargez des jetons pour acheter cet onglet.
ja: タブ購入にはトークンが必要です。
ko: 탭을 구매하려면 토큰을 충전해주세요.
ru: Пополните токены для покупки вкладки.

source: Open token store
ar: فتح متجر الرموز
es: Abrir tienda de tokens
fr: Ouvrir la boutique
ja: トークンストアへ
ko: 토큰 상점 열기
ru: Открыть магазин токенов

# noThanks
source: No
ar: لا
fr: Non
ja: いいえ
ko: 아니오
ru: Нет

# confirm
source: OK
ar: حسنًا
ko: 확인
ru: ОК

# confirmPurchase
source: Purchase
ar: شراء
es: Comprar
fr: Acheter
ja: 購入
ko: 구매
ru: Купить

# purchaseTabTitle
source: Purchase tab {tab}
ar: شراء التبويب {tab}
es: Comprar pestaña {tab}
fr: Acheter l'onglet {tab}
ja: タブ{tab}購入
ko: {tab} 탭 구매
ru: Купить вкладку {tab}

# purchaseTabBody
source: {cost} tokens for 30 days. Proceed?
ar: {cost} رمزًا لمدة 30 يومًا. متابعة؟
es: {cost} tokens por 30 días. ¿Continuar?
fr: {cost} jetons pour 30 jours. Continuer ?
ja: 30日利用 {cost}トークン。購入しますか？
ko: 30일 이용권 {cost} 토큰을 사용합니다. 구매할까요?
ru: {cost} токенов на 30 дней. Продолжить?

# tabPurchaseLedger
source: Tab {tab} purchase
ar: شراء تبويب {tab}
es: Compra pestaña {tab}
fr: Achat onglet {tab}
ja: タブ{tab}購入
ko: {tab} 탭 이용권 구매
ru: Покупка вкладки {tab}

# tokenPurchaseLedger
source: Token purchase +{count} ({price})
ar: شراء رموز +{count} ({price})
es: Compra de tokens +{count} ({price})
fr: Achat de jetons +{count} ({price})
ja: トークン追加 +{count} ({price})
ko: 토큰 충전 +{count} ({price})
ru: Покупка токенов +{count} ({price})

# tokensBalanceLabel
source: Balance: {count}
ar: الرصيد: {count}
es: Saldo: {count}
fr: Solde : {count}
ja: 保有トークン: {count}
ko: 보유 토큰: {count}
ru: Баланс: {count}

# tabUsageTitle
source: Tab access
ar: حالة التبويبات
es: Uso de pestañas
fr: Accès aux onglets
ja: タブ利用状況
ko: 탭 이용 현황
ru: Доступ к вкладкам

# tabLabelWithIndex
source: Tab {label}
ar: تبويب {label}
es: Pestaña {label}
fr: Onglet {label}
ja: {label}タブ
ko: {label} 탭
ru: Вкладка {label}

# tabRemainingLabel
source: Remaining {time}
ar: المتبقي {time}
es: Restante {time}
fr: Reste {time}
ja: 残り {time}
ko: 잔여 {time}
ru: Осталось {time}

# tabLockedLabel
source: Locked
ar: مغلق
es: Bloqueada
fr: Verrouillé
ja: ロック
ko: 잠김
ru: Заблокировано

# tokenHistoryTitle
source: Token history
ar: سجل الرموز
es: Historial de tokens
fr: Historique des jetons
ja: トークン履歴
ko: 토큰 내역
ru: История токенов

source: Not signed in
ar: غير مسجّل
es: No has iniciado sesión
fr: Non connecté
ja: 未ログイン
ko: 로그인되지 않음
ru: Не вошли

source: Sign out
ar: تسجيل الخروج
es: Cerrar sesión
fr: Se déconnecter
ja: ログアウト
ko: 로그아웃
ru: Выйти

# noArticlesFound
source: Updates automatically at regular intervals.
ar: يتم التحديث تلقائيًا على فترات منتظمة.
es: Se actualiza automáticamente a intervalos regulares.
fr: Mises à jour automatiques à intervalles réguliers.
ja: 一定の周期で自動更新されます。
ko: 일정 주기에 맞춰 자동 업데이트 됩니다.
ru: Автоматически обновляется через регулярные интервалы.

source: Failed to load news.
ar: تعذر تحميل الأخبار.
es: No se pudieron cargar las noticias.
fr: Échec du chargement des actualités.
ja: ニュースの読み込みに失敗しました。
ko: 뉴스를 불러오지 못했습니다.
ru: Не удалось загрузить новости.

source: Summary unavailable.
ar: الملخص غير متوفر.
es: Resumen no disponible.
fr: Résumé indisponible.
ja: 要約を取得できません。
ko: 요약을 불러올 수 없습니다.
ru: Резюме недоступно.

source: Failed to load article.
ar: تعذر تحميل المقال.
es: No se pudo cargar el artículo.
fr: Échec du chargement de l'article.
ja: 記事の読み込みに失敗しました。
ko: 기사를 불러오지 못했습니다.
ru: Не удалось загрузить статью.

source: No article content.
ar: لا يوجد محتوى للمقال.
es: No hay contenido del artículo.
fr: Aucun contenu d'article.
ja: 記事内容がありません。
ko: 기사 내용이 없습니다.
ru: Нет содержания статьи.

source: Translation on
ar: الترجمة مفعلة
es: Traducción activada
fr: Traduction activée
ja: 翻訳表示
ko: 번역 보기
ru: Перевод включен

source: Original on
ar: الأصل مفعّل
es: Original activado
fr: Original affiché
ja: 原文表示
ko: 원문 보기
ru: Оригинал включен

source: Content unavailable.
ar: المحتوى غير متوفر.
es: Contenido no disponible.
fr: Contenu indisponible.
ja: 内容を取得できません。
ko: 내용을 불러올 수 없습니다.
ru: Содержимое недоступно.

source: Translate full article
ar: ترجمة المقال بالكامل
es: Traducir artículo completo
fr: Traduire l'article complet
ja: 本文を翻訳
ko: 본문 번역
ru: Перевести статью полностью

source: Translating...
ar: جارٍ الترجمة...
es: Traduciendo...
fr: Traduction...
ja: 翻訳中...
ko: 번역 중...
ru: Перевод...

source: Open original
ar: فتح الأصل
es: Abrir original
fr: Ouvrir l'original
ja: 原文を開く
ko: 원문 열기
ru: Открыть оригинал

source: Open original article
ar: فتح المقال الأصلي
es: Abrir artículo original
fr: Ouvrir l'article original
ja: 原文記事を開く
ko: 원문 기사 열기
ru: Открыть оригинальную статью

# summarySettingsTitle
source: Summary settings
ar: إعدادات الملخص
es: Configuración del resumen
fr: Paramètres du résumé
ja: 要約設定
ko: 요약 설정
ru: Настройки резюме

# summaryLengthLabel
source: Summary length
ar: طول الملخص
es: Longitud del resumen
fr: Longueur du résumé
ja: 要約の長さ
ko: 요약 길이
ru: Длина резюме

# summaryShort
source: Short
ar: قصير
es: Corto
fr: Court
ja: 短め
ko: 짧게
ru: Короткое

# summaryMedium
source: Medium
ar: متوسط
es: Medio
fr: Moyen
ja: 普通
ko: 중간
ru: Среднее

# summaryLong
source: Long
ar: طويل
es: Largo
ja: 長め
ko: 길게
ru: Длинное

# summaryFull
source: Full text (no summary)
ar: النص الكامل (بدون ملخص)
es: Texto completo (sin resumen)
fr: Texte complet (sans résumé)
ja: 全文（要約なし）
ko: 원문 전체 (요약 없음)
ru: Полный текст (без резюме)

# summarySave
source: Save
ar: حفظ
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
ru: Сохранить

# summaryLimitedNotice
source: This article cannot be fully viewed in the app. Please open the link below to read it.
ar: لا يمكن عرض هذه المقالة كاملة داخل التطبيق. يرجى فتح الرابط أدناه لقراءتها.
es: Este artículo no se puede ver completo en la app. Abre el enlace de abajo para leerlo.
fr: Cet article ne peut pas être consulté entièrement dans l'application. Veuillez ouvrir le lien ci-dessous pour le lire.
ja: この記事はアプリ内で全文を表示できません。下のリンクから直接開いてご覧ください。
ko: 해당 기사는 앱에서 완전한 열람이 불가합니다. 아래 링크로 직접 접속하시어 읽어주시기 바랍니다.
ru: Эта статья не может быть полностью показана в приложении. Откройте ссылку ниже, чтобы прочитать её.

# translationLongContentNotice
source: The original text is too long. A summarized translation is shown.
ar: النص الأصلي طويل جدًا. يتم عرض ملخص مترجم.
es: El texto original es demasiado largo. Se muestra un resumen traducido.
fr: Le texte original est trop long. Un résumé traduit est affiché.
ja: 本文が長いため、要約版で提供しています。
ko: 원문이 길어 요약본으로 제공됩니다.
ru: Исходный текст слишком длинный. Показана переведенная сводка.

# urgentBadge
source: Urgent
ar: عاجل
es: Urgente
ja: 緊急
ko: 긴급
ru: Срочно

# translatingBadge
source: AI processing
ar: جارٍ المعالجة بالذكاء الاصطناعي
es: Procesando con IA
fr: Traitement IA
ja: AI処理中
ko: AI 가공 중
ru: Обработка ИИ

# processingEtaMinutes
source: about {minutes} min
ar: حوالي {minutes} دقيقة
es: aprox. {minutes} min
fr: env. {minutes} min
ja: 約{minutes}分
ko: 약 {minutes}분
ru: примерно {minutes} мин

source: Sign in with Google
ar: تسجيل الدخول عبر Google
es: Iniciar sesión con Google
fr: Se connecter avec Google
ja: Google でログイン
ko: Google로 로그인
ru: Войти через Google

# tapToConnectAccount
source: Tap below to connect your account.
ar: اضغط أدناه لربط حسابك.
es: Toca abajo para conectar tu cuenta.
fr: Touchez ci-dessous pour connecter votre compte.
ja: 下のボタンでアカウントを接続します。
ko: 아래 버튼으로 계정을 연결하세요.
ru: Нажмите ниже, чтобы подключить аккаунт.

source: Google Account
ar: حساب Google
es: Cuenta de Google
fr: Compte Google
ja: Google アカウント
ko: Google 계정
ru: Аккаунт Google

# connectSync
source: Connect to sync keywords and tokens across devices.
ar: مزامنة الكلمات المفتاحية والرموز عبر الأجهزة.
es: Sincroniza palabras clave y tokens entre dispositivos.
fr: Synchronisez les mots-clés et les jetons entre appareils.
ja: キーワードとトークンを端末間で同期します。
ko: 키워드와 토큰을 기기 간 동기화합니다.
ru: Синхронизация ключевых слов и токенов между устройствами.

source: Continue with Google
ar: المتابعة باستخدام Google
es: Continuar con Google
fr: Continuer avec Google
ja: Google で続行
ko: Google로 계속
ru: Продолжить с Google

source: Tokens Store
ar: متجر الرموز
es: Tienda de tokens
fr: Boutique de jetons
ja: トークンストア
ko: 토큰 상점
ru: Магазин токенов

source: Report article
ar: الإبلاغ عن المقال
es: Reportar este artículo
fr: Signaler cet article
ja: この記事を報告する
ko: 이 기사 신고하기
ru: Пожаловаться на статью

# blockSource
source: Block this source
ar: حظر هذا المصدر
es: Bloquear este medio
fr: Bloquer ce média
ja: このメディアをブロック
ko: 이 언론사 차단하기
ru: Заблокировать источник

# blockedSourceToast
source: Source blocked.
ar: تم حظر المصدر.
es: Se bloqueó este medio.
fr: Ce média a été bloqué.
ja: このメディアをブロックしました。
ko: 해당 언론사를 차단했습니다.
ru: Источник заблокирован.

# blockedSourcesTitle
source: Blocked sources
ar: المصادر المحظورة
es: Fuentes bloqueadas
fr: Sources bloquées
ja: ブロックしたメディア
ko: 차단된 언론사
ru: Заблокированные источники

# blockedSourcesEmpty
source: No blocked sources.
ar: لا توجد مصادر محظورة.
es: No hay fuentes bloqueadas.
fr: Aucune source bloquée.
ja: ブロックしたメディアはありません。
ko: 차단한 언론사가 없습니다.
ru: Заблокированных источников нет.

# unblockSource
source: Unblock
ar: إلغاء الحظر
es: Desbloquear
fr: Débloquer
ja: 解除
ko: 차단 해제
ru: Разблокировать

# unblockedSourceToast
source: Source unblocked.
ar: تم إلغاء الحظر عن المصدر.
es: Fuente desbloqueada.
fr: Source débloquée.
ja: ブロックを解除しました。
ko: 차단을 해제했습니다.
ru: Источник разблокирован.

# reportedArticleToast
source: Report submitted.
ar: تم إرسال البلاغ.
es: El reporte fue enviado.
fr: Le signalement a été envoyé.
ja: 記事の報告を受け付けました。
ko: 기사 신고가 접수되었습니다.
ru: Жалоба отправлена.

# tokenPackLabel
source: {count} Tokens
ar: {count} رمز
fr: {count} jetons
ja: {count} トークン
ko: {count} 토큰
ru: {count} токенов

# perTokenPrice
source: {price} per token
ar: {price} لكل رمز
es: {price} por token
fr: {price} par jeton
ja: 1トークンあたり {price}
ko: 토큰당 {price}
ru: {price} за токен

source: Language
ar: اللغة
es: Idioma
fr: Langue
ja: 言語
ko: 언어
ru: Язык

source: Retry
ar: إعادة المحاولة
es: Reintentar
fr: Réessayer
ja: 再試行
ko: 다시 시도
ru: Повторить

# purchaseFailedCheckPayment
source: Purchase failed. Please check purchase availability and payment method, then try again.
ar: فشلت عملية الشراء. تحقّق من إمكانية الشراء ووسيلة الدفع ثم حاول مرة أخرى.
ko: 결제에 실패했습니다. 결제 가능 여부 및 결제 수단 확인 후 다시 결제해주세요.

# settingsTitle
source: Settings
ar: الإعدادات
es: Configuración
fr: Paramètres
ja: 設定
ko: 설정
ru: Настройки

# settingsAppearanceTitle
source: Appearance
ar: المظهر
es: Apariencia
fr: Apparence
ja: 外観
ko: 모양
ru: Внешний вид

source: Contact support
ar: الاتصال بالدعم
es: Contactar soporte
fr: Contacter l’assistance
ja: お問い合わせ
ko: 문의하기
ru: Связаться с поддержкой

# reviewPromptTitle
source: Enjoying SCOOP?
ar: هل تستمتع بـ SCOOP؟
es: ¿Te gusta SCOOP?
fr: Vous aimez SCOOP ?
ja: SCOOPはいかがですか？
ko: SCOOP은 어떠신가요?
ru: Нравится SCOOP?

# reviewPromptBody
source: How would you rate the app?
ar: كيف تقيّم التطبيق؟
es: ¿Qué calificación le das a la app?
fr: Quelle note donneriez-vous à l’application ?
ja: アプリの評価をお願いします。
ko: 앱을 평가해 주세요.
ru: Как бы вы оценили приложение?

# reviewPromptLater
source: Later
ar: لاحقًا
es: Más tarde
fr: Plus tard
ja: 後で
ko: 나중에
ru: Позже

# reviewPromptContinue
source: Continue
ar: متابعة
es: Continuar
fr: Continuer
ja: 続ける
ko: 계속
ru: Далее

# reviewHighTitle
source: Thanks!
ar: شكرًا!
es: ¡Gracias!
fr: Merci !
ja: ありがとうございます！
ko: 감사합니다!
ru: Спасибо!

# reviewHighBody
source: Would you like to leave a review on the store?
ar: هل ترغب في كتابة مراجعة على المتجر؟
es: ¿Quieres dejar una reseña en la tienda?
fr: Souhaitez-vous laisser un avis sur la boutique ?
ja: ストアにレビューを投稿しますか？
ko: 스토어에 리뷰를 남겨주실래요?
ru: Хотите оставить отзыв в магазине?

# reviewWriteAction
source: Write a review
ar: اكتب مراجعة
es: Escribir reseña
fr: Écrire un avis
ja: レビューを書く
ko: 리뷰 쓰기
ru: Написать отзыв

# reviewLowTitle
source: Send feedback
ar: إرسال ملاحظات
es: Enviar comentarios
fr: Envoyer des commentaires
ja: フィードバック
ko: 의견 보내기
ru: Обратная связь

# reviewLowBody
source: Tell us what we can improve.
ar: أخبرنا بما يمكن تحسينه.
es: Cuéntanos qué podemos mejorar.
fr: Dites-nous ce que nous pouvons améliorer.
ja: 改善のため、ご意見をお聞かせください。
ko: 불편한 점을 알려주시면 개선에 도움이 됩니다.
ru: Расскажите, что можно улучшить.

# bannedTitle
source: Account suspended
ar: تم إيقاف الحساب
es: Cuenta suspendida
fr: Compte suspendu
ja: アカウントが停止されました
ko: 계정이 정지되었습니다
ru: Аккаунт заблокирован

# bannedBody
source: This account has been suspended. If you believe this is a mistake, please contact support.
ar: تم إيقاف هذا الحساب. إذا كنت تعتقد أن ذلك خطأ، يرجى التواصل مع الدعم.
es: Esta cuenta ha sido suspendida. Si crees que es un error, contacta con soporte.
fr: Ce compte a été suspendu. Si vous pensez qu'il s'agit d'une erreur, veuillez contacter l’assistance.
ja: このアカウントは停止されています。誤りだと思われる場合はサポートにお問い合わせください。
ko: 이 계정은 이용이 제한되었습니다. 문제가 있다면 문의하기로 알려주세요.
ru: Этот аккаунт заблокирован. Если вы считаете, что это ошибка, свяжитесь со службой поддержки.

# developerEmailTitle
source: Developer email
ar: بريد المطور الإلكتروني
es: Correo del desarrollador
fr: Email du développeur
ja: 開発者メール
ko: 개발자 이메일
ru: Email разработчика

# savedArticlesTitle
source: Saved articles
ar: المقالات المحفوظة
es: Artículos guardados
fr: Articles enregistrés
ja: 保存した記事
ko: 저장한 기사
ru: Сохранённые статьи

# savedArticlesEmpty
source: No saved articles yet.
ar: لا توجد مقالات محفوظة.
es: No hay artículos guardados.
fr: Aucun article enregistré.
ja: 保存した記事がありません。
ko: 저장된 기사가 없습니다.
ru: Сохранённых статей нет.

# saveArticle
source: Save
ar: حفظ
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
ru: Сохранить

# removeSaved
source: Remove
ar: إزالة
es: Quitar
fr: Retirer
ja: 解除
ko: 해제
ru: Удалить

# autoRenewTitle
source: Auto renewal
ar: التجديد التلقائي
es: Renovación automática
fr: Renouvellement automatique
ja: 自動更新
ko: 자동 결제
ru: Автопродление

# autoRenewSubtitle
source: Charge 2 tokens 1 hour before expiry
ar: خصم رمزين قبل ساعة من الانتهاء
es: Cobrar 2 tokens 1 hora antes del vencimiento
fr: Facturer 2 jetons 1 heure avant l'expiration
ja: 期限の1時間前に2トークン課金
ko: 만료 1시간 전에 2토큰 결제
ru: Списывать 2 токена за час до окончания
