Repository: anmt2805/NEWSCrawling
Catalog: app/lib/l10n/app_*.arb
Languages: ar, es, fr, ja, ko, ru

# ledgerPurchase
source: Token top-up
ar: شحن الرموز
es: Recarga de tokens
fr: Recharge de jetons
ja: トークンチャージ
ko: 토큰 충전
ru: Пополнение токенов

# ledgerSpend
source: Tab purchase
ar: شراء تبويب
es: Compra de pestaña
fr: Achat d'onglet
ja: タブ購入
ko: 탭 구매
ru: Покупка вкладки

# ledgerAutoRenew
source: Auto renewal
ar: التجديد التلقائي
es: Renovación automática
fr: Renouvellement automatique
ja: 自動更新
ko: 자동 결제
ru: Автопродление

# ledgerSpendWithTab
source: Tab purchase · {tab}
ar: شراء تبويب · {tab}
es: Compra de pestaña · {tab}
fr: Achat d’onglet · {tab}
ja: タブ購入 · {tab}
ko: 탭 구매 · {tab}
ru: Покупка вкладки · {tab}

# ledgerAutoRenewWithTab
source: Auto renewal · {tab}
ar: التجديد التلقائي · {tab}
es: Renovación automática · {tab}
fr: Renouvellement automatique · {tab}
ja: 自動更新 · {tab}
ko: 자동 결제 · {tab}
ru: Автопродление · {tab}

# autoRenewConfirmTitle
source: Enable auto renewal?
ar: تفعيل التجديد التلقائي؟
es: ¿Activar renovación automática?
fr: Activer le renouvellement automatique ?
ja: 自動更新を有効にしますか？
ko: 자동 결제를 켤까요?
ru: Включить автопродление?

# autoRenewConfirmBody
source: We will charge 2 tokens 1 hour before expiry to keep tabs active.
ar: سيتم خصم الرمزين تلقائيًا قبل ساعة من انتهاء التبويب، فقط إذا كانت لديك رموز كافية.
es: Cobraremos 2 tokens 1 hora antes del vencimiento para mantener las pestañas activas.
fr: Nous débiterons 2 jetons 1 heure avant l'expiration pour prolonger l'accès.
ja: 期限の1時間前に2トークンを課金してタブを延長します。
ko: 만료 1시간 전에 2토큰을 결제하여 탭을 연장합니다.
ru: Мы спишем 2 токена за час до окончания, чтобы продлить доступ.

# autoRenewConfirmEnable
source: Enable
ar: تفعيل
es: Activar
fr: Activer
ja: 有効にする
ko: 켜기
ru: Включить

# autoRenewFailedTitle
source: Auto renewal failed
ar: فشل التجديد التلقائي
es: Fallo de renovación automática
fr: Renouvellement automatique échoué
ja: 自動更新に失敗
ko: 자동 결제 실패
ru: Автопродление не удалось

# autoRenewFailedBody
source: Auto renewal failed due to insufficient tokens.
ar: الرموز غير كافية، تم إيقاف التجديد التلقائي.
es: La renovación automática falló por falta de tokens.
fr: Le renouvellement automatique a échoué faute de jetons.
ja: トークン不足のため自動更新に失敗しました。
ko: 토큰이 부족하여 자동 결제가 실패했습니다.
ru: Автопродление не удалось из-за нехватки токенов.

# autoRenewSuccessTitle
source: Auto renewal success
ko: 자동 결제 성공

# autoRenewSuccessBody
source: {count} tabs renewed for 30 more days.
ko: {count}개 탭 자동 결제 성공, 30일 연장되었습니다.

# autoRenewSuccessTabsBody
source: {tabs} auto renewal succeeded and extended 30 days.
ko: {tabs} 자동 결제 성공, 30일 연장되었습니다.

# shareArticle
source: Share
ar: مشاركة
es: Compartir
fr: Partager
ja: 共有
ko: 공유
ru: Поделиться

# shareSheetTitle
source: Share news
ar: مشاركة الخبر
es: Compartir noticia
fr: Partager l'article
ja: ニュースを共有
ko: 기사 공유
ru: Поделиться новостью

# shareSheetShare
source: Share to app
ar: مشاركة عبر تطبيق
es: Compartir con app
fr: Partager vers une app
ja: アプリで共有
ko: 앱으로 공유
ru: Поделиться через приложение

# shareSheetCopy
source: Copy
ar: نسخ
es: Copiar
fr: Copier
ja: コピー
ko: 복사하기
ru: Копировать

# shareCopiedToast
source: Copied to clipboard.
ar: تم النسخ إلى الحافظة.
es: Copiado al portapapeles.
fr: Copié dans le presse-papiers.
ja: クリップボードにコピーしました。
ko: 클립보드에 복사했습니다.
ru: Скопировано в буфер.

# shareMessage
source: Seen this news? {title} {url} ⚡ Get the world’s top stories faster with AI translation and summaries on 'SCOOP'.
ar: هل رأيت هذا الخبر؟ {title} {url} ⚡ أهم أخبار العالم أسرع بترجمة وتلخيص الذكاء الاصطناعي عبر «SCOOP».
es: ¿Viste esta noticia? {title} {url} ⚡ Las noticias clave del mundo, más rápido con traducción y resúmenes IA en «SCOOP».
fr: Tu as vu cette actu ? {title} {url} ⚡ Les infos essentielles du monde, plus vite grâce aux résumés et traductions IA sur « SCOOP ».
ja: このニュース見た？ {title} {url} ⚡ 世界の重要ニュースをAI翻訳・要約で最速チェック。『SCOOP』で確認しよう。
ko: 이 뉴스 봤어? {title} {url} ⚡ 전 세계 핵심 뉴스, 'SCOOP'에서 AI 번역, 요약으로 가장 빠르게 확인하세요.
ru: Видел(а) эту новость? {title} {url} ⚡ Ключевые новости мира быстрее с AI‑переводом и краткими обзорами в «SCOOP».

# rateLimitToast
source: Too many update requests. Try again in {seconds}s.
ar: طلبات تحديث كثيرة جدًا. حاول مرة أخرى بعد {seconds} ثانية.
es: Demasiadas solicitudes de actualización. Intenta de nuevo en {seconds}s.
fr: Trop de demandes de mise à jour. Réessaie dans {seconds}s.
ja: 更新リクエストが多すぎます。{seconds}秒後に再試行してください。
ko: 업데이트 요청이 너무 많습니다. {seconds}초 후 다시 시도하세요.
ru: Слишком много запросов на обновление. Повторите через {seconds} c.

# tokenStoreSubscriptionNote
source: Subscribe to at least one paid tab for unlimited translations without ads.
ar: اشترك في علامة تبويب مدفوعة واحدة على الأقل للحصول على ترجمة غير محدودة بدون إعلانات.
es: Suscríbete a al menos una pestaña de pago para traducciones ilimitadas sin anuncios.
fr: Abonnez-vous à au moins un onglet payant pour des traductions illimitées sans publicité.
ja: 有料タブを1つ以上購読すると、広告なしで無制限翻訳が可能です。
ko: 유료 탭 1개 이상 구독 시 광고 없이 무제한 번역 가능
ru: Подпишитесь минимум на одну платную вкладку, чтобы получить неограниченный перевод без рекламы.

# subscribeTabPromptTitle
source: Subscribe to this keyword tab?
ar: هل تريد الاشتراك في علامة تبويب الكلمات المفتاحية؟
es: ¿Suscribirse a esta pestaña de palabras clave?
fr: S’abonner à cet onglet de mots-clés ?
ja: キーワードタブを購読しますか？
ko: 키워드 탭을 구독하시겠습니까?
ru: Подписаться на эту вкладку с ключевыми словами?

# insufficientTokensPromptTitle
source: Not enough tokens
ar: الرموز غير كافية
es: No hay suficientes tokens
fr: Pas assez de jetons
ja: トークンが不足しています
ko: 토큰이 부족합니다
ru: Недостаточно токенов

# insufficientTokensPromptBody
source: Go to the token store?
ar: هل تريد الانتقال إلى متجر الرموز؟
es: ¿Ir a la tienda de tokens?
fr: Aller à la boutique de jetons ?
ja: トークンストアへ移動しますか？
ko: 토큰 상점으로 이동하시겠습니까?
ru: Перейти в магазин токенов?

# bannerSponsored
source: Sponsored
ar: برعاية
es: Patrocinado
fr: Sponsorisé
ja: スポンサー
ko: 스폰서
ru: Спонсировано

# bannerHeadline
source: Discover personalized news benefits
ar: اكتشف مزايا الأخبار المخصصة
es: Descubre beneficios de noticias personalizados
fr: Découvrez des avantages d’actualités personnalisés
ja: パーソナライズされたニュース特典をチェック
ko: 맞춤형 뉴스 혜택을 확인하세요
ru: Откройте персональные новости и предложения

# bannerAdLabel
source: Ad
ar: إعلان
es: Anuncio
fr: Pub
ja: 広告
ko: 광고
ru: Реклама

# freeTranslationTitle
source: Free translations
ar: ترجمات مجانية
es: Traducciones gratuitas
fr: Traductions gratuites
ja: 無料翻訳の案内
ko: 무료 번역 안내
ru: Бесплатные переводы

# freeTranslationUsage
source: You used {used} free translations; {remaining} left today.
ar: استخدمت {used} ترجمة مجانية؛ يتبقى {remaining} اليوم.
es: Has usado {used} traducciones gratuitas; te quedan {remaining} hoy.
fr: Vous avez utilisé {used} traductions gratuites ; il vous en reste {remaining} aujourd’hui.
ja: 無料翻訳を{used}回使用し、残り{remaining}回です。
ko: 무료 번역 {used}회 사용하여 {remaining}회 남았습니다
ru: Вы использовали {used} бесплатных переводов; осталось {remaining} на сегодня.

# freeTranslationRemaining
source: You have {count} free translations left today.
ar: يتبقى لديك اليوم {count} ترجمة مجانية.
es: Te quedan {count} traducciones gratuitas hoy.
fr: Il vous reste {count} traductions gratuites aujourd’hui.
ja: 本日の無料翻訳はあと{count}回です。
ko: 오늘 무료 번역 {count}회 남았습니다
ru: Сегодня осталось {count} бесплатных переводов.

# freeTranslationExhausted
source: You have used all free translations today.
ar: لقد استخدمت جميع الترجمات المجانية اليوم.
es: Has usado todas las traducciones gratuitas de hoy.
fr: Vous avez utilisé toutes les traductions gratuites aujourd’hui.
ja: 本日の無料翻訳はすべて使い切りました。
ko: 오늘 무료 번역을 모두 사용했습니다
ru: Вы использовали все бесплатные переводы на сегодня.

# translationAdTitle
source: Ad
ar: إعلان
es: Anuncio
fr: Pub
ja: 広告
ko: 광고
ru: Реклама

# translationAdBody
source: An ad is being shown.
ar: سيتم عرض إعلان.
es: Se mostrará un anuncio.
fr: Une publicité s’affiche.
ja: 広告が表示されます。
ko: 광고가 표시됩니다.
ru: Показывается реклама.

# onboardingTitle1
source: All the world’s news in your hand
ar: أخبار العالم بين يديك
es: Todas las noticias del mundo en tu mano
fr: Toute l’actualité mondiale dans votre main
ja: 世界のニュースを手のひらに
ko: 전 세계 뉴스를 한 손에
ru: Все мировые новости у вас в руке

# onboardingBody1
source: Set the keywords you care about. See major news in real time from the U.S., UK, Japan, and more.
ar: أضف الكلمات التي تهمك. تابع أهم الأخبار من الولايات المتحدة والمملكة المتحدة واليابان وغيرها لحظة بلحظة.
es: Registra tus palabras clave. Consulta noticias principales de EE. UU., Reino Unido, Japón y más en tiempo real.
fr: Ajoutez vos mots-clés favoris. Suivez les grandes actus des États-Unis, du Royaume-Uni, du Japon, etc., en temps réel.
ja: 気になるキーワードを登録。 米国・英国・日本など主要ニュースをリアルタイムでチェック。
ko: 관심 있는 키워드를 등록하세요. 미국, 영국, 일본 등 원하는 국가의 주요 뉴스를 실시간으로 확인하세요.
ru: Добавьте интересующие ключевые слова. Следите за новостями США, Великобритании, Японии и других стран в реальном времени.

# onboardingTitle2
source: No time? You’re covered
ar: حتى لو كنت مشغولًا
es: ¿Sin tiempo? No pasa nada
fr: Pressé ? Aucun souci
ja: 忙しくても大丈夫
ko: 바빠도 괜찮아요
ru: Нет времени? Не страшно

# onboardingBody2
source: AI summarizes long articles in 3 lines and translates global news into your language.
ar: الذكاء الاصطناعي يلخّص المقالات الطويلة في 3 أسطر ويترجم الأخبار العالمية إلى لغتك.
es: La IA resume artículos largos en 3 líneas y traduce noticias internacionales a tu idioma.
fr: L’IA résume les longs articles en 3 lignes et traduit les actus internationales dans votre langue.
ja: AIが世界のニュースをリアルタイムで要約。 長い記事は3行に、海外ニュースはあなたの言語に翻訳します。
ko: AI가 전 세계 뉴스를 실시간으로 요약해줍니다. 긴 기사는 3줄로 요약하고, 해외 뉴스는 사용자의 언어로 번역합니다.
ru: ИИ сокращает длинные статьи до 3 строк и переводит мировые новости на ваш язык.

# onboardingTitle3
source: Subscribe to your interests
ar: اشترك باهتماماتك
es: Suscríbete a tus intereses
fr: Abonnez-vous à vos centres d’intérêt
ja: 興味を購読しよう
ko: 관심사를 구독하세요
ru: Подписывайтесь на интересы

# onboardingBody3
source: Collect tokens to unlock more keyword tabs and build your own news feed.
ar: اجمع الرموز لفتح المزيد من التبويبات. بيتكوين، الذكاء الاصطناعي… أنشئ موجزك الخاص.
es: Acumula tokens para abrir más pestañas. Bitcoin, IA… crea tu propio feed de noticias.
fr: Accumulez des jetons pour débloquer plus d’onglets. Bitcoin, IA… créez votre propre fil d’actualités.
ja: トークンを集めてタブを増やそう。 ビットコインやAIなど、キーワードで自分だけのニュースフィードを作成。
ko: 토큰을 모아 더 많은 키워드 탭을 열어보세요. 비트코인, AI 등 원하는 키워드로 나만의 뉴스 피드를 만드세요.
ru: Собирайте токены, чтобы открыть больше вкладок. Bitcoin, AI — создайте свою ленту новостей.

# onboardingSkip
source: Skip
ar: تخطي
es: Saltar
fr: Passer
ja: スキップ
ko: 건너뛰기
ru: Пропустить

# onboardingNext
source: Next
ar: التالي
es: Siguiente
fr: Suivant
ja: 次へ
ko: 다음
ru: Далее

# onboardingDone
source: Get started
ar: ابدأ
es: Empezar
fr: Commencer
ja: 開始する
ko: 시작하기
ru: Начать

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية
es: Política de privacidad
fr: Politique de confidentialité
ja: プライバシーポリシー
ko: 개인정보처리방침
ru: Политика конфиденциальности

# privacyPolicyButton
source: Privacy Policy / Refund Terms
ar: سياسة الخصوصية / شروط الاسترداد
es: Política de privacidad / Condiciones de reembolso
fr: Politique de confidentialité / Conditions de remboursement
ja: プライバシーポリシー / 返金規約
ko: 개인정보처리방침 / 환불약관
ru: Политика конфиденциальности / Условия возврата

# accountDeletionTitle
source: Delete account
ar: حذف الحساب
es: Eliminar cuenta
fr: Supprimer le compte
ja: アカウント削除
ko: 계정 탈퇴
ru: Удалить аккаунт

# privacyConsentTitle
source: Privacy Consent
ar: موافقة الخصوصية
es: Consentimiento de privacidad
fr: Consentement à la confidentialité
ja: 個人情報の同意
ko: 개인정보 동의
ru: Согласие на обработку данных

# privacyConsentBody
source: To use the app, you must agree to the required items below.
ar: لاستخدام التطبيق، يجب الموافقة على البنود الإلزامية أدناه.
es: Para usar la app, debes aceptar los elementos obligatorios a continuación.
fr: Pour utiliser l'application, vous devez accepter les éléments obligatoires ci-dessous.
ja: アプリを利用するには、以下の必須項目に同意する必要があります。
ko: 앱을 이용하려면 아래 필수 항목에 동의해야 합니다.
ru: Чтобы пользоваться приложением, необходимо согласиться с обязательными пунктами ниже.

# privacyConsentRequiredHint
source: Please check all required items to continue.
ar: يرجى تحديد جميع البنود الإلزامية للمتابعة.
es: Marca todos los elementos obligatorios para continuar.
fr: Cochez tous les éléments obligatoires pour continuer.
ja: 必須項目にすべてチェックすると同意できます。
ko: 필수 항목에 모두 체크해야 동의할 수 있습니다.
ru: Отметьте все обязательные пункты, чтобы продолжить.

# privacyConsentPolicyLabel
source: [Required] Agree to Privacy Policy
ar: [إلزامي] الموافقة على سياسة الخصوصية
es: [Obligatorio] Aceptar la política de privacidad
fr: [Obligatoire] Accepter la politique de confidentialité
ja: 【必須】プライバシーポリシーに同意
ko: [필수] 개인정보처리방침 동의
ru: [Обязательно] Согласие с политикой конфиденциальности

# privacyConsentOverseasLabel
source: [Required] Agree to overseas transfer of personal data (Google/Firebase/AdMob)
ar: [إلزامي] الموافقة على نقل البيانات خارج الدولة (Google/Firebase/AdMob)
es: [Obligatorio] Aceptar la transferencia internacional de datos (Google/Firebase/AdMob)
fr: [Obligatoire] Accepter le transfert international des données (Google/Firebase/AdMob)
ja: 【必須】個人情報の国外移転に同意（Google/Firebase/AdMob など）
ko: [필수] 개인정보 국외이전 동의 (Google/Firebase/AdMob 등)
ru: [Обязательно] Согласие на международную передачу данных (Google/Firebase/AdMob)

# privacyConsentDecline
source: Decline
ar: رفض
es: Rechazar
fr: Refuser
ja: 同意しない
ko: 동의거부
ru: Отказаться

# privacyConsentAccept
source: Agree
ar: موافقة
es: Aceptar
fr: Accepter
ja: 同意する
ko: 동의
ru: Согласиться
